stefanobstacle/0.orig/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 373.15;

boundaryField
{
    "sym.*"
    {
        type            symmetryPlane;
    }

    faceWall
    {
      type            fixedValue;
      value           uniform 373.15;
    }

    outlet
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
      type compressible::turbulentTemperatureCoupledBaffleMixed;
      Tnbr                         T;
      kappaMethod             lookup;
      kappa                    kappa;
      value           uniform 373.15;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
