stefanobstacle/0.orig/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "sym.*"
    {
        type            symmetryPlane;
    }
     fluid_to_solid
  {
      type           noSlip;
  }

    faceWall
    {
        type            fixedValue;
        value           uniform (3.6e-4 0 0);
    }

    frontAndBack
    {
        type            empty;
    }

    outlet
    {
        type            zeroGradient;

    }
}

// ************************************************************************* //
