stefanobstacle/0.orig/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    "sym.*"
    {
        type            symmetryPlane;
    }

    outlet
    {
      type            fixedValue;
      value           uniform 1e5;
    }

    faceWall
    {
      type            fixedFluxPressure;
    }
     fluid_to_solid
   {
       type            zeroGradient;
   }

  frontAndBack
  {
      type            empty;
  }
}

// ************************************************************************* //
