stefanobstacle/0.orig/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{

    "sym1|sym2"
    {
        type            symmetryPlane;
    }

  faceWall
  {
      type            fixedFluxPressure;
  }
  fluid_to_solid
   {
       type            zeroGradient;
   }
  outlet
  {
        type            fixedValue;
        value           uniform 1e5;
  }

  frontAndBack
  {
      type            empty;
  }
}

// ************************************************************************* //
