stefanobstacle/0.orig/solid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    "sym.*"
    {
        type            symmetryPlane;
    }
        solid_to_fluid
      {
          type            calculated;
          value           $internalField;
      }

    outlet
    {
      type            calculated;
      value           $internalField;
    }

    faceWall
    {
      type            calculated;
      value           $internalField;
    }


  frontAndBack
  {
      type            empty;
  }
}

// ************************************************************************* //
